output/zeroflush_m3_perf/r59_rerun/native_read_50GB.log
RocksDB:    version 11.2.0
Date:       Tue Sep  1 09:56:33 2026
CPU:        36 * Intel(R) Core(TM) i9-10980XE CPU @ 3.00GHz
CPUCache:   25344 KB
Set seed to 1788227792621443 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    48000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    47607.4 MB (estimated)
FileSize:   24169.9 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
DB path: [/tmp/nat_50]
readrandom   :      34.365 micros/op 465575 ops/sec 17.183 seconds 8000000 operations;  291.9 MB/s (316152 of 500000 found)